src/Catalogs/док_УстройстваСУдаленнымУправлением.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>док_УстройстваСУдаленнымУправлением</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>удалить_Программа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.удалить_док_ПрограммыУдаленногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_Устройства</v8:Type>
						<v8:Type>cfg:CatalogRef.док_Серверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.док_ПрограммыУдаленногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/док_ОбновлениеИнформационнойБазыСлужебный/Ext/Module.bsl
Процедура ПерезаполнитьПрограммыУдаленногоУправленияВ_УстройствахСУУ() Экспорт
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	док_УстройстваСУдаленнымУправлением.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.док_УстройстваСУдаленнымУправлением КАК док_УстройстваСУдаленнымУправлением
	|ГДЕ
	|	НЕ док_УстройстваСУдаленнымУправлением.удалить_Программа = ЗНАЧЕНИЕ(Перечисление.удалить_док_ПрограммыУдаленногоУправления.ПустаяСсылка)");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Об.Программа = Справочники.док_ПрограммыУдаленногоУправления[ОбщегоНазначения.ИмяЗначенияПеречисления(Об.удалить_Программа)];
			Об.удалить_Программа = Перечисления.удалить_док_ПрограммыУдаленногоУправления.ПустаяСсылка();
			Об.Записать();
		Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
